remote-home/testdata/goal_runs/20260709_193434_baseline_all3_noproxy/bench.log
===== throughput: 4-8K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f82ca2830a0>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./4-8K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_193434_baseline_all3_noproxy/results/4-8K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-d86bfd3a-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-09 19:35:00 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:25<00:00, 12.68s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [00:23<00:00,  7.75s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  23.24     
Total input tokens:                      19847     
Total generated tokens:                  172       
Request throughput (req/s):              0.13      
Output token throughput (tok/s):         7.40      
Peak output token throughput (tok/s):    16.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          861.48    
---------------Time to First Token----------------
Mean TTFT (ms):                          3608.65   
Median TTFT (ms):                        4339.09   
P50 TTFT (ms):                           4339.09   
P95 TTFT (ms):                           4343.93   
P99 TTFT (ms):                           4344.36   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          68.54     
Median TPOT (ms):                        68.77     
P50 TPOT (ms):                           68.77     
P95 TPOT (ms):                           68.78     
P99 TPOT (ms):                           68.78     
---------------Inter-token Latency----------------
Mean ITL (ms):                           67.49     
Median ITL (ms):                         68.79     
P50 ITL (ms):                            68.79     
P95 ITL (ms):                            69.39     
P99 ITL (ms):                            69.90     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          7478.00   
Median E2EL (ms):                        8539.15   
P50 E2EL (ms):                           8539.15   
P95 E2EL (ms):                           10144.32  
P99 E2EL (ms):                           10287.00  
==================================================
===== throughput: 8-16K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f6df694b0a0>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./8-16K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_193434_baseline_all3_noproxy/results/8-16K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-39041db3-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-09 19:36:17 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:37<00:00, 18.68s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [01:15<00:00, 25.00s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  75.01     
Total input tokens:                      38677     
Total generated tokens:                  600       
Request throughput (req/s):              0.04      
Output token throughput (tok/s):         8.00      
Peak output token throughput (tok/s):    15.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          523.66    
---------------Time to First Token----------------
Mean TTFT (ms):                          10892.01  
Median TTFT (ms):                        12296.30  
P50 TTFT (ms):                           12296.30  
P95 TTFT (ms):                           13151.31  
P99 TTFT (ms):                           13227.32  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          69.68     
Median TPOT (ms):                        69.52     
P50 TPOT (ms):                           69.52     
P95 TPOT (ms):                           69.99     
P99 TPOT (ms):                           70.03     
---------------Inter-token Latency----------------
Mean ITL (ms):                           69.21     
Median ITL (ms):                         69.45     
P50 ITL (ms):                            69.45     
P95 ITL (ms):                            70.33     
P99 ITL (ms):                            70.87     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          24733.46  
Median E2EL (ms):                        18669.78  
P50 E2EL (ms):                           18669.78  
P95 E2EL (ms):                           39234.55  
P99 E2EL (ms):                           41062.53  
==================================================
===== throughput: 16-32K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f8a63d730a0>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./16-32K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_193434_baseline_all3_noproxy/results/16-32K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-236b3899-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-09 19:38:37 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:52<00:00, 26.13s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [01:47<00:00, 35.89s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  107.66    
Total input tokens:                      64238     
Total generated tokens:                  388       
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         3.60      
Peak output token throughput (tok/s):    14.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          600.26    
---------------Time to First Token----------------
Mean TTFT (ms):                          26433.93  
Median TTFT (ms):                        26310.97  
P50 TTFT (ms):                           26310.97  
P95 TTFT (ms):                           28234.23  
P99 TTFT (ms):                           28405.19  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          71.28     
Median TPOT (ms):                        71.35     
P50 TPOT (ms):                           71.35     
P95 TPOT (ms):                           71.66     
P99 TPOT (ms):                           71.68     
---------------Inter-token Latency----------------
Mean ITL (ms):                           71.02     
Median ITL (ms):                         71.67     
P50 ITL (ms):                            71.67     
P95 ITL (ms):                            72.23     
P99 ITL (ms):                            72.69     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          35619.20  
Median E2EL (ms):                        31662.17  
P50 E2EL (ms):                           31662.17  
P95 E2EL (ms):                           47351.83  
P99 E2EL (ms):                           48746.47  
==================================================

===== result files =====
/public/home/tangyu408/testdata/goal_runs/20260709_193434_baseline_all3_noproxy/results/4-8K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260709_193434_baseline_all3_noproxy/results/16-32K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260709_193434_baseline_all3_noproxy/results/8-16K_throughput/result.json